In [11]:
import numpy as np

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [2]:
# 반복되는 row를 제외하고 unique한 row값만 출력하도록 한다.
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [3]:
# number of unique : 유니한 row의 갯수를 출력하는 메소드 nunique()
df['col2'].nunique()

3

In [4]:
len(df['col2'].unique())

3

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [19]:
df1 = pd.DataFrame({'학생번호':[1,2,3,4,5,6,7,8],
                   '좋아하는 간식':['햄버거','피자','김밥','햄버거','샐러드','떡볶이','샐러드','샐러드'],
                   '좋아하는 색깔':['red','blue','blue','yello','blue','violet','yello','red',]})
df1

   학생번호 좋아하는 간식 좋아하는 색깔
0     1     햄버거     red
1     2      피자    blue
2     3      김밥    blue
3     4     햄버거   yello
4     5     샐러드    blue
5     6     떡볶이  violet
6     7     샐러드   yello
7     8     샐러드     red

In [18]:
df1['좋아하는 간식'].value_counts()

샐러드    3
햄버거    2
피자     1
김밥     1
떡볶이    1
Name: 좋아하는 간식, dtype: int64

In [20]:
df1['좋아하는 색깔'].value_counts()

blue      3
red       2
yello     2
violet    1
Name: 좋아하는 색깔, dtype: int64

In [13]:
newdf = df

In [14]:
newdf

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [15]:
newdf[(newdf["col1"]>2)&(newdf["col2"] == 444)]
# 두가지 조건을 한꺼번에 만족시켜야 하기 때문에 &로 조건을 줘야 한다.

   col1  col2 col3
3     4   444  xyz

In [21]:
def time2(x):
    return x*2

In [22]:
df['col1'].apply(time2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [23]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [24]:
df1['좋아하는 간식'].apply(len)

0    3
1    2
2    2
3    3
4    3
5    3
6    3
7    3
Name: 좋아하는 간식, dtype: int64

In [25]:
del df['col1']

In [26]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [27]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [28]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [29]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                  'col2':[np.nan,555,666,444],
                  'col3':['abc','def','ghi','xyz']})

In [30]:
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [31]:
df.fillna('없음')

  col1   col2 col3
0  1.0     없음  abc
1  2.0  555.0  def
2  3.0  666.0  ghi
3   없음  444.0  xyz

In [32]:
df.fillna(df[['col1','col2']].mean())

   col1   col2 col3
0   1.0  555.0  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   2.0  444.0  xyz

In [33]:
df4 = pd.DataFrame({"A":['인문','인문','인문','정보','정보','정보'],
                   "B":['1학년','1학년','2학년','2학년','1학년','1학년'],
                   "C":['여','남','여','남','여','남'],
                   "D":[90,80,75,50,100,40]})

In [34]:
df4

    A    B  C    D
0  인문  1학년  여   90
1  인문  1학년  남   80
2  인문  2학년  여   75
3  정보  2학년  남   50
4  정보  1학년  여  100
5  정보  1학년  남   40